<h1>Условия - практическая 3</h1>
<h3>Задача 1</h3>
<?php
$a = 3;
$b = 5;
if ($a > $b) {
    $res = $a + $b;
    echo "a= $a, b= $b, сумма= $res";
} else {
    $res= $a * $b;
    echo "a= $a, b= $b, произведение= $res";
}
?>

<h3>Задача 2</h3>
<?php
$a = 60;
$b = 20;
if (($a + $b < 180 && $a > 0 && $b > 0)) {
    if ($a == 90 || $b == 90) {
        echo "a= $a, b= $b, существует такой треугольник и он прямоугольный";
    } else {
        echo "a= $a, b= $b, существует такой треугольник, но он НЕ прямоугольный";
    }
} else {
    echo "a= $a, b= $b, нет такого треугольника";
}
?>

<h3>Задача 3</h3>
<?php
$age = 5;
$ageGroup = '';
if ($age <= 1) {
    $ageGroup = 'Котята';
} elseif ($age >= 1 && $age <= 3) {
    $ageGroup = 'Молодые коты';
} elseif ($age > 3 && $age <= 7) {
    $ageGroup = 'Коты средних лет';
} else {
    $ageGroup = 'Почтенные коты';
}
echo "age = $age, $ageGroup";
?>

<h3>Задача 4</h3>
<?php
$a = 2;
$b = 4;
$c = 6;
if (($a + $b > $c ) && ($a + $c > $b) && ($c + $b > $a)) {
    echo "a= $a, b= $b, c= $c, Такой треугольник существует";
} else {
    echo "a= $a, b= $b, c= $c, Такого треугольника НЕ существует";
}
?>

<h3>Задача 5</h3>
<?php
$n = 2026;
if (($n % 4 == 0 && $n % 100 != 0) || ($n % 400 == 0)) {
    echo "n= $n, Год високосный";
} else {
    echo "n= $n, Год НЕ високосный";
}
?>
<h3>Задача 6</h3>
<?php
$a = 32767;
$b = -1;
$sum = $a + $b;
if ($sum > 32767 || $sum < -32768) {
    echo 'Результат привел к переполнению';
} else {
    echo 'Результат НЕ привел к переполнению. ';
    echo "a+b=$sum";
}
?>

<h3>Задача 7</h3>
<?php
$a = 2;
$b = 2;
$x = 2;
$y = 3;
$z = 3;
if (($a >= $x && $b >= $y) || ($a >= $y && $b >= $x) || 
    ($a >= $x && $b >= $z) || ($a >= $z && $b >= $x) || 
    ($a >= $y && $b >= $z) || ($a >= $z && $b >= $y)) {
    echo 'Кирпич пройдет через отверстие';
} else {
    echo 'Кирпич не пройдет через отверстие';
}
?>

<h3>Задача 8</h3>
<?php
$n = 60; 
$isLeap = false; 
$daysInMonth = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];
$month = 1;
foreach ($daysInMonth as $days) {
    if ($n <= $days) {
        break; 
    }
    $n -= $days; 
    $month++;
}
echo "Месяц: $month, День: $n";
?>

<h3>Задача 9</h3>
<?php
$n = 24;
if ($n % 4 == 0 && $n % 6 == 0) {
    echo 'Число делится на 4 и 6';
} else {
    echo 'Число НЕ делится на 4 и 6';
}
?>

<h3>Задача 10</h3>
<?php
$x = 5;
$y = -6;
$r = 8;
if ($x**2 + $y**2 <= $r**2) {
    echo 'Данная точка лежит внутри круга';
} else {
    echo 'Данная точка НЕ лежит внутри круга';
}
?>